{
    "FR": {
        "welcome-description": "Développeur Fullstack et Designer UI/UX ",
        "welcome-title": "NAFLOWS, de Mougel David",
        "switch-lang": "Changer de langue",
        "lang": "FR",
        "openToWork": {
            "clients": "Besoin d'un développeur ou designer ?",
            "contactText": "Contactez-moi !"
        },
        "requestDemo" : "Vous pouvez demander une démo !",
        "projectLanguage" : "Ce projet est en anglais",
        "home" : "Accueil",
        "journey" : {
            "title" : "Mon parcours",
            "description" : "Découvrez mon parcours professionnel, de mes débuts en tant que développeur autodidacte à mon évolution vers un développeur fullstack et designer UI/UX expérimenté, avec une passion pour la création de solutions numériques innovantes et accessibles.",
            "tiles" : [
                {
                    "title" : "Starblast.io",
                    "description" : "Mon jeu de coeur, Starblast.io, a été le point de départ de ma découverte de NodeJS. A partir de l'API de ce jeu, j'ai pu développer des mods plus ou moins complexes dans l'objectif de créer des expériences de jeu uniques et personnalisées pour les joueurs, tout en approfondissant mes compétences en développement algorithmique avec NodeJS.",
                    "date" : 2019,
                    "url" : "https://starblast.io/",
                    "image" : "/assets/starblast.png",
                    "timespan" : "Trois ans",
                    "accessible":  true
                },
                {
                    "title" : "La Suite Sesame",
                    "description" : "Au travers de mon aventure dans le développement de mods pour Starblast.io, j'ai développé une expertise en NodeJS et en HTML/CSS qui m'a permis de créer La Suite Sesame, un ensemble de deux outils, l'un servant d'affichage de données récoltées sur le jeu, et l'autre étant un dashboard de contrôle pour les dataminers, leur permettant d'ajouter indépendamment des données pour Sesame.",
                    "date" : 2022,
                    "url" : "https://archives.naflows.com/content/github.io/sesame/index.html",
                    "image" : "/assets/sesame.png",
                    "timespan" : "Un an et demi",
                    "accessible":  true
                }, 
                {
                    "title" : "Albus & Algus",
                    "description" : "C'est mon premier projet ancré dans le réel et répondant à un besoin vraiment précis: l'affichage des horaires de bus en temps réel basé sur une étude d'un set de données. Albus, l'application web, et Algus, l'algorithme, ont été développés pour aider les usager à avoir des détails précis sur les horaires de bus. Ce projet a été porté aurpès de l'agence Libéa, qui n'a pas donné suite au projet malgré une démonstration à leurs bureaux.",
                    "date" : 2024,
                    "url" : "https://archives.naflows.com/content/albi-bus/index.html",
                    "image" : "/assets/albus.png",
                    "timespan" : "Quelques mois",
                    "accessible":  true
                },
                {
                    "title" : "NASS",
                    "description" : "Le NASS est mon projet le plus poussé à ce jour, qui vise comme objectif premier à fournir une infrastructure de SSO et de gestion d'accès pour les environnements cloud de Naflows, mon auto-entreprise, avec une attention particulière portée à la sécurité, la flexibilité, et la facilité d'intégration pour ensuite être mise à disposition d'autres projets. Ce projet a été développé dans le cadre de mon activité professionnelle chez Naflows, où j'ai pu développer mes compétences en développement fullstack et en design UI/UX pour créer une solution robuste et innovante.",
                    "date" : 2025,
                    "url" : "https://github.com/naflows/naflows-auth",
                    "image" : "/assets/naflows.png",
                    "timespan" : "En cours de développement",
                    "accessible":  true
                },
                {
                    "title" : "Naflows",
                    "description" : "Naflows est mon auto-entreprise de développement web et de design UI/UX, créée pour offrir des services de qualité à mes clients tout en me permettant de continuer à développer mes compétences et à travailler sur des projets passionnants. Depuis sa création, Naflows a été le cadre de projets personnels et d'une prestation client à ce jour, dont le développement du NASS. Toutefois, cette activité est en cumul de mes études et de mon travail.",
                    "url" : "https://naflows.com",
                    "image" : "/assets/naflows.png",
                    "timespan" : "Depuis 2024",
                    "date" : 2024,
                    "accessible":  false
                }
            ]
        },

        "cards": {
            "cv": {
                "title": "Mon CV",
                "description": "Consultez mon CV en ligne pour découvrir mon parcours professionnel, mes compétences techniques et mes réalisations en développement web et design UI/UX.",
                "actionName": " Télécharger mon CV"
            },
            "design": {
                "title": "Mes designs",
                "description": "Découvrez une sélection de mes travaux de design UI/UX, mettant en avant ma créativité et mon expertise dans la création d'expériences utilisateur attrayantes et fonctionnelles.",
                "actionName": "Voir mes designs"
            },
            "nass": {
                "title": "NASS",
                "description": "Découvrez le projet NASS, un système avancé de SSO et de gestion d'accès pour les environnements cloud et locaux.",
                "actionName": "Voir le workflow",
                "url": "https://github.com/Naflows/naflows-auth",
                "image": "/assets/naflows.png"
            },
            "archives": {
                "title": "Mes archives",
                "description": "Explorez mes archives de projets passés, mettant en lumière mon parcours de développement et de design à travers une variété de réalisations.",
                "actionName": "Voir mes archives",
                "url": "https://archives.naflows.com"
            }
        },
        "design": {
            "files" : "Fichiers",
            "title" : "Mes designs",
            "description": "Découvrez une sélection de mes travaux de design UI/UX, mettant en avant ma créativité et mon expertise dans la création d'expériences utilisateur attrayantes et fonctionnelles.",
            "history" : "J'ai commencé à m'intéresser au design UI/UX en 2022, en parallèle de mon activité de développeur: le frontend était fait pour moi. Je me suis formé de manière autodidacte, en m'inspirant de designs existants comme M3 de Google, et en expérimentant avec des outils comme Figma. J'ai rapidement développé une passion pour la création d'interfaces utilisateur intuitives et esthétiques, réfléchies et fonctionnelles, ce qui m'a conduit à intégrer le design dans mes projets professionnels et personnels.",
            "content": [
                {
                    "name": "NASS Workflow",
                    "url": "files/NASS_Workflow.pdf",
                    "description": "Découvrez le workflow du projet NASS, un système avancé de SSO et de gestion d'accès pour les environnements cloud et locaux.",
                    "developed" : true,
                    "language": "EN",
                    "files": [
                        {
                            "name": "Panneau de contrôle Administrateur NASS",
                            "url": "/files/design/NASS_AdminPanel.pdf"
                        },
                        {
                            "name" : "Application Fonctionnelle NASS",
                            "url": "/files/design/NASS_App.pdf"
                        },
                        {
                            "name" : "[Déprécié] Workflow Système De Protection NASS",
                            "url": "/files/design/NASS_SystemFlowOutdated.pdf"
                        }
                    ]
                },
                {
                    "name" : "Requêtes de pompes",
                    "description" : "Découvrez les designs de l'application de requêtes de pompes, une plateforme interactive pour suivre et analyser les performances des exercices de pompes.",
                    "language": "FR",
                    "developed" : false,
                    "files" : [
                        {
                            "name" : "Composants de l'application",
                            "url" : "/files/design/Pushups_App_Components.pdf"
                        },
                        {
                            "name" : "Application globable",
                            "url" : "/files/design/Pushups_App_Main.pdf"
                        }
                    ]
                },
                {
                    "name": "Naflows Commercial",
                    "description": "Découvrez les designs de Naflows en tant qu'entreprise commerciale offrant des services de développement et de design UI/UX.",
                    "language": "EN",
                    "developed" : false,
                    "files": [
                        {
                            "name": "Suivi de commande",
                            "url": "/files/design/Naflows_Commercial_Order_Tracking.pdf"
                        },
                        {
                            "name": "Dashboard Admin",
                            "url": "/files/design/Naflows_Commercial_Admin_Dashboard.pdf"
                        },
                        {
                            "name": "Site Vitrine",
                            "url": "/files/design/Naflows_Commercial_Landing_Page.pdf"
                        },
                        {
                            "name": "Portail de connexion",
                            "url": "/files/design/Naflows_Commercial_Login_Portal.pdf"
                        },
                        {
                            "name": "Emails",
                            "url": "/files/design/Naflows_Commercial_Emails.pdf"
                        }
                    ]
                },
                {
                    "name": "Local Shops App",
                    "url": "/files/Local_Shops_App.pdf",
                    "description": "Explorez les designs de l'application Local Shops, une plateforme visant à promouvoir les commerces locaux et à faciliter les achats de proximité.",
                    "developed" : false,
                    "language": "FR",
                    "files": [
                        {
                            "name": "Page d'accueil",
                            "url": "/files/design/Local_Shops_App_Homepage.pdf"
                        },
                        {
                            "name": "Vérification du commerce",
                            "url": "/files/design/Local_Shops_App_Business_Verification.pdf"
                        },
                        {
                            "name": "Composants UI",
                            "url": "/files/design/Local_Shops_App_UI_Components.pdf"
                        }
                    ]
                }
            ]
        },
        "about-me" : {
            "title" : "Mes ambitions et valeurs",
            "ambitionsContent": {
                "title" : "Trois ambitions principales"
            },
            "valuesContent": {
                "title" : "Travailler avec moi signifie"
            },
            "ambitions" : [
                {
                    "name" : "Créer des solutions numériques innovantes et accessibles",
                    "description" : "Je m'efforce de concevoir et de développer des solutions numériques qui répondent aux besoins de mes clients et utilisateurs, en mettant l'accent sur l'innovation, la convivialité, et l'accessibilité pour tous.",
                    "icon" : "innovation"
                },
                {
                    "name" : "Accompagner mes clients et collaborateurs dans leur transformation numérique",
                    "description" : "Je m'engage à accompagner mes clients et collaborateurs dans leur transformation numérique, en partageant mes connaissances et mon expertise pour les aider à comprendre et à adopter les technologies numériques de manière efficace et stratégique.",
                    "icon" : "support"
                },
                {
                    "name" : "Améliorer constamment mes compétences et connaissances",
                    "description" : "Je suis passionné par l'apprentissage continu et je m'efforce d'améliorer constamment mes compétences et connaissances dans les domaines du développement web, du design UI/UX, et des technologies numériques en général, afin de rester à la pointe de l'innovation et de fournir des solutions de haute qualité à mes clients.",
                    "icon" : "improvement"
                }
            ],
            "values": [
                {
                    "name": "Collaboration"               },
                {
                    "name": "Pédagogie"                },
                {
                    "name": "Souveraineté numérique"
                },
                {
                    "name": "Perfection & Excellence"
                },
                {
                    "name": "Transparence"
                },
                {
                    "name": "Ponctualité"
                },
                {
                    "name": "Imagination"
                }
             ]
        },
        "learn-more": {
            "title": "En savoir plus",
            "links": [
                {
                    "name": "Mes ambitions et valeurs",
                    "url": "/about-me"
                },
                {
                    "name": "Mon parcours",
                    "url": "/skills"
                },
                {
                    "name": "Devblog",
                    "url": "/projects"
                },
                {
                    "name": "Ko-Fi",
                    "url": "https://ko-fi.com/naflouille"
                }
            ]
        }
    },
    "EN": {
        "welcome-description": "Fullstack Developer and UI/UX Designer",
        "welcome-title": "NAFLOWS, by David Mougel",
        "lang": "EN",
        "switch-lang": "Switch language",
        "openToWork": {
            "clients": "Looking for a developer or designer? ",
            "contactText": "Contact me!"
        },
        "home" : "Home",
        "requestDemo" : "You can request a demo!",
        "projectLanguage" : "This project is in English",
        "journey" : {
            "title" : "My journey",
            "description" : "Discover my professional journey, from my beginnings as a self-taught developer to my evolution into an experienced fullstack developer and UI/UX designer, with a passion for creating innovative and accessible digital solutions.",
            "tiles" : [
                {
                    "title" : "Starblast.io",
                    "description" : "My beloved game, Starblast.io, was the starting point of my discovery of NodeJS. From the API of this game, I was able to develop more or less complex mods with the goal of creating unique and personalized gaming experiences for players, while deepening my skills in algorithmic development with NodeJS.",
                    "date" : 2019,
                    "url" : "https://starblast.io/",
                    "image" : "/assets/starblast.png",
                    "timespan" : "Three years",
                    "accessible":  true
                },
                {
                    "title" : "La Suite Sesame",
                    "description" : "Through my adventure in developing mods for Starblast.io, I developed expertise in NodeJS and HTML/CSS that allowed me to create La Suite Sesame, a set of two tools, one serving as a data display collected on the game, and the other being a control dashboard for dataminers, allowing them to independently add data for Sesame.",
                    "date" : 2022,
                    "url" : "https://archives.naflows.com/content/github.io/sesame/index.html",
                    "image" : "/assets/sesame.png",
                    "timespan" : "One year and a half",
                    "accessible":  true
                }, 
                {
                    "title" : "Albus & Algus",
                    "description" : "This is my first project anchored in reality and responding to a really specific need: the display of real-time bus schedules based on a study of a dataset. Albus, the web application, and Algus, the algorithm, were developed to help users have precise details on bus schedules. This project was carried out with the agency Libéa, which did not follow up on the project despite a demonstration at their offices.",
                    "date" : 2024,
                    "url" : "https://archives.naflows.com/content/albi-bus/index.html",
                    "image" : "/assets/albus.png",
                    "timespan" : "A few months",
                    "accessible":  true
                },
                {
                    "title" : "NASS",
                    "description" : "NASS is my most advanced project to date, which aims as its primary objective to provide an infrastructure for SSO and access management for the cloud environments of Naflows, my auto-enterprise, with a particular focus on security, flexibility, and ease of integration to then be made available to other projects. This project was developed as part of my professional activity at Naflows, where I was able to develop my skills in fullstack development and UI/UX design to create a robust and innovative solution.",
                    "date" : 2025,
                    "url" : "https://github.com/Naflows/naflows-auth",
                    "image": "/assets/naflows-blue.png",
                    "timespan" : "Six months",
                    "accessible":  true
                },
                {
                    "title" : "Naflows",
                    "description" : "Naflows is my auto-enterprise of web development and UI/UX design, created to offer quality services to my clients while allowing me to continue developing my skills and working on exciting projects. Since its creation, Naflows has been the framework for personal projects and one client service to date, including the development of NASS. However, this activity is in addition to my studies and work.",
                    "url" : "https://naflows.com",
                    "image": "/assets/naflows-blue.png",
                    "timespan" : "Since 2024",
                    "date" : 2024,
                    "accessible":  false
                }
            ]
        },

        "cards": {
            "cv": {
                "title": "My CV",
                "description": "Check out my online CV to discover my professional background, technical skills, and achievements in web development and UI/UX design.",
                "actionName": "Download my CV"
            },
            "design": {
                "title": "My designs",
                "description": "Discover a selection of my UI/UX design works, showcasing my creativity and expertise in creating engaging and functional user experiences.",
                "actionName": "See my designs"
            },
            "nass": {
                "title": "NASS",
                "description": "Discover the NASS project, an advanced SSO and access management system for cloud and on-premises environments.",
                "actionName": "See the workflow",
                "url": "https://github.com/Naflows/naflows-auth",
                "image": "/assets/naflows.png"
            },
            "archives": {
                "title": "My archives",
                "description": "Explore my archives of past projects, highlighting my development and design journey through a variety of achievements.",
                "actionName": "See my archives",
                "url": "https://archives.naflows.com"
            }
        },
        "design": {
            "title" : "My designs",
            "files" : "Files",
            "description": "Discover a selection of my UI/UX design works, showcasing my creativity and expertise in creating engaging and functional user experiences.",
            "history" : "I started getting interested in UI/UX design in 2022, alongside my activity as a developer: frontend was made for me. I taught myself, drawing inspiration from existing designs like Google's M3, and experimenting with tools like Figma. I quickly developed a passion for creating intuitive and aesthetic user interfaces, thoughtful and functional, which led me to integrate design into my professional and personal projects.",
            "content": [
                {
                    "name": "NASS Workflow",
                    "description": "Discover the workflow of the NASS project, an advanced SSO and access management system for cloud and on-premises environments.",
                    "language": "EN",
                    "developed" : true,
                    "files": [
                        {
                            "name": "NASS Admin Panel",
                            "url": "/files/design/NASS_AdminPanel.pdf"
                        },
                        {
                            "name" : "NASS Functional App",
                            "url": "/files/design/NASS_App.pdf"
                        },
                        {
                            "name" : "[Deprecated] NASS Protection System Workflow",
                            "url": "/files/design/NASS_SystemFlowOutdated.pdf"
                        }
                    ]
                },
                {
                    "name" : "Pushups Requests",
                    "description" : "Coach-student platform for issuing push-up challenges with video verification. Features include completion tracking, performance streaks, and progress objectives.",
                    "language": "EN",
                    "developed" : false,
                    "files" : [
                        {
                            "name" : "UI Components",
                            "url" : "/files/design/Pushups_App_Components.pdf"
                        },
                        {
                            "name" : "Overall Application",
                            "url" : "/files/design/Pushups_App_Main.pdf"
                        }
                    ]
                },
                {
                    "name": "Naflows Commercial",
                    "description": "Explore the designs of Naflows as a commercial company offering development and UI/UX design services.",
                    "language": "FR",
                    "developed" : false,
                    "files": [
                        {
                            "name": "Order Tracking",
                            "url": "/files/design/Naflows_Commercial_Order_Tracking.pdf"
                        },
                        {
                            "name": "Admin Dashboard",
                            "url": "/files/design/Naflows_Commercial_Admin_Dashboard.pdf"
                        },
                        {
                            "name": "Landing Page",
                            "url": "/files/design/Naflows_Commercial_Landing_Page.pdf"
                        },
                        {
                            "name": "Login Portal",
                            "url": "/files/design/Naflows_Commercial_Login_Portal.pdf"
                        },
                        {
                            "name": "Emails",
                            "url": "/files/design/Naflows_Commercial_Emails.pdf"
                        }
                    ]
                },
                {
                    "name": "Local Shops App",
                    "description": "Explore the designs of the Local Shops app, a platform aimed at promoting local businesses and facilitating neighborhood shopping.",
                    "language": "FR",
                    "developed" : false,
                    "files": [
                        {
                            "name": "Homepage",
                            "url": "/files/design/Local_Shops_App_Homepage.pdf"
                        },
                        {
                            "name": "Business Verification",
                            "url": "/files/design/Local_Shops_App_Business_Verification.pdf"
                        },
                        {
                            "name": "UI Components",
                            "url": "/files/design/Local_Shops_App_UI_Components.pdf"
                        }
                    ]
                }
            ]
        },
        "about-me" : {
            "title" : "My ambitions and values",

            "ambitionsContent" : {
                "title" : "Three main ambitions"
            },
            "valuesContent" : {
                "title" : "Working with me means"
            },
            "ambitions" : [
                {
                    "name" : "Create accessible digital solutions",
                    "description" : "I strive to design and develop digital solutions that meet the needs of my clients and users, with a focus on innovation, user-friendliness, and accessibility for all.",
                    "icon" : "innovation"
                },
                {
                    "name" : "Support my collaborators in their digital transformation",
                    "description" : "I am committed to supporting my clients and collaborators in their digital transformation, sharing my knowledge and expertise to help them understand and adopt digital technologies effectively and strategically.",
                    "icon" : "support"
                },
                {
                    "name" : "Constantly improve my skills and knowledge",
                    "description" : "I am passionate about continuous learning and strive to constantly improve my skills and knowledge in web development, UI/UX design, and digital technologies in general, in order to stay at the forefront of innovation and provide high-quality solutions to my clients.",
                    "icon" : "improvement"
                }
            ],
            "values" : [
                {
                    "name": "Collaboration"               },
                {
                    "name": "Pedagogy"                },
                {
                    "name": "Digital sovereignty"
                },
                {
                    "name": "Perfection & Excellence"
                },
                {
                    "name": "Transparency"
                },
                {
                    "name": "Punctuality"
                },
                {
                    "name": "Imagination"
                }
            ]
        },
        "learn-more": {
            "title": "Learn more",
            "links": [
                {
                    "name": "My ambitions and values",
                    "url": "/about-me"
                },
                {
                    "name": "My journey",
                    "url": "/skills"
                },
                {
                    "name": "Devblog",
                    "url": "/projects"
                },
                {
                    "name": "Ko-Fi",
                    "url": "https://ko-fi.com/naflouille"
                }
            ]
        }
    }
}